
## Plan Result




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights_preview[0]
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0]
* Update
  * module.adoption-app-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.adoption-app-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights_preview[0] will be created
  + resource "azurerm_application_insights" "appinsights_preview" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "westeurope"
      + name                                  = "adoption-appinsights-preview"
      + resource_group_name                   = "adoption-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/adoption-shared-infrastructure.git"
          + "application"         = "adoption"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#adoption-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Adoption"
        }
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0] will be created
  + resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY_PREVIEW" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"
      + name         = "AppInsightsInstrumentationKey-Preview"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.adoption-app-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "ManageContacts",
            "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
            "SetIssuers",
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat/objectId/4e4859f5-363b-48e3-92b7-7ff6bbf78a9a"
        key_permissions         = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "Recover",
        ]
        key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"
        object_id               = "4e4859f5-363b-48e3-92b7-7ff6bbf78a9a"
      ~ secret_permissions      = [
            "List",
            "Set",
            "Delete",
          + "Recover",
        ]
        storage_permissions     = []
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.adoption-app-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat|adoption-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "adoption-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"","Vars":{}} -->